"{\n    \"macro structure\": \"The article follows a clear scientific journalism structure, opening with a hook about the mystery, followed by detailed evidence and expert opinions. The narrative flows from introducing the site, through various theories, to current research findings, ending with open questions that maintain reader interest.\",\n    \n    \"language style\": \"Professional yet accessible, balancing technical terms ('necropolis', 'cirque') with clear explanations. Uses precise descriptive language and maintains an objective tone while conveying scientific information. Quotes are strategically placed to add authority and break up technical descriptions.\",\n    \n    \"narrative techniques\": \"Employs third-person perspective with expert citations. Uses a mystery-solving framework, gradually revealing evidence and theories. Scene-setting descriptions help readers visualize the remote location. Time shifts between present observations and historical context are handled smoothly.\",\n    \n    \"theme expression\": \"Centers on archaeological discovery and scientific investigation. The mystery of the site's origins serves as the core narrative thread, with supporting evidence carefully layered to build credibility for the new Zoroastrian theory.\",\n    \n    \"structure\": \"Well-organized with clear subheadings that guide readers through different aspects of the discovery. Paragraphs are concise and focused, typically addressing one main point each. Transitions between sections are logical and smooth.\",\n    \n    \"writing techniques\": \"Uses vivid geographical descriptions to establish setting. Employs comparison techniques (e.g., 'Texas-sized island') to help readers grasp scale. Balances technical details with accessible explanations.\",\n    \n    \"innovation\": \"Successfully combines elements of scientific reporting with narrative storytelling techniques. Maintains reader engagement while presenting complex archaeological evidence.\",\n    \n    \"cultural context\": \"Effectively explains historical and religious contexts of Zoroastrianism and Portuguese exploration. Provides necessary cultural background without overwhelming the main narrative.\",\n    \n    \"economy of language\": \"Concise yet informative, with no unnecessary elaboration. Technical terms are introduced with clear context and explanation.\",\n    \n    \"stylistic characteristics\": \"Demonstrates balanced scientific journalism style, combining factual reporting with engaging narrative elements. Maintains consistent tone throughout while building tension around the archaeological mystery.\"\n}"