"{\n    \"macro structure\": \"The article follows a clear investigative structure, starting with a hook about the mystery, followed by detailed site description, research process, and ending with open questions. Transitions between sections are smooth, using geographical and chronological progression.\",\n    \n    \"language style\": \"Academic yet accessible, using precise archaeological and geological terminology balanced with descriptive language. Formal tone with occasional colloquial phrases like 'Texas-sized' to aid reader comprehension.\",\n    \n    \"narrative techniques\": \"Third-person objective perspective with expert quotes integrated for authority. Linear chronological progression with occasional historical context. Detailed physical descriptions create clear mental imagery of the site.\",\n    \n    \"information structure\": \"Layered presentation moving from surface observations to deeper archaeological analysis. Evidence and counterarguments are systematically presented, building toward the Zoroastrian theory.\",\n    \n    \"theme expression\": \"Mystery and scientific discovery are core themes, expressed through careful presentation of evidence and theories. Maintains scientific skepticism while building intrigue.\",\n    \n    \"writing techniques\": \"Uses specific measurements and geographical details for precision. Employs compare-contrast technique (Madagascar vs. Iran sites) to support main argument. Expert quotes strategically placed to validate key points.\",\n    \n    \"innovation\": \"Effectively combines scientific reporting with elements of mystery narrative. Balances technical detail with accessible explanations.\",\n    \n    \"cultural context\": \"Demonstrates strong awareness of historical and religious contexts, particularly regarding Zoroastrian practices and Portuguese exploration history.\",\n    \n    \"economy of language\": \"Efficient prose with minimal redundancy. Complex archaeological concepts explained concisely without oversimplification.\",\n    \n    \"stylistic characteristics\": \"Maintains consistent scholarly tone while keeping reader engagement through strategic revelation of evidence and theories. Regular use of expert quotes and specific details establishes credibility.\"\n}"